import 'package:flutter/material.dart';
import 'package:openspaces/hospitalmap/widgets/covid_app_bar.dart';

class FactCheck {
  String title;
  String answers;

  FactCheck({ this.title, this.answers });
  
  static List<FactCheck> get factCheckList {
    List<FactCheck> factCheckList = [];
    factCheckList.add(FactCheck(title: "१. के कोरोना भाइरस (कोभिड–१९) लामखुट्टेको टोकाईबाट सर्छ? ", answers: "हालसम्म कोरोना भाइरस लामखुट्टेको टोकाईबाट सरेको पुष्टि भएको छैन।यो श्वासप्रश्वासबाट सर्ने भाइरस हो। कोरोना भाइरसबाट संक्रमित व्यक्त्तिले खोक्दा र हाँच्छ्यु गर्दा निस्कने थुक र सिँगानको माध्यमबाट एक व्यक्तिबाट अर्को व्यक्त्तिमा सर्दछ।"));
    factCheckList.add(FactCheck(title: "२. के लसुन खानाले कोरोना भाइरसको संक्रमणबाट बच्न सकिन्छ?", answers: "हालसम्म लसुन खानाले कोरोना भाइरसको संक्रमण हुनबाट रोकथाम भएको तथ्य प्रमाणित भएको छैन। लसुन स्वास्थ्यको लागि लाभदायक छ र यसले हामीलाई स्वस्थ राख्न मद्दत गर्दछ।"));
    factCheckList.add(FactCheck(title: "३. के तिलको तेलको मालिसले कोरोना भाइरस शरीरमा प्रवेश गर्नबाट रोक्छ?", answers: "तिलको तेलले मालिस गर्नाले कोरोना भाइरस शरीरमा प्रवेश गर्नबाट रोक्दैन। तिलको तेलले कोरोना भाइरसलाई मार्न सक्दैन। भुई वा सतहमा भएको कोरोना भाइरसलाई निःसंक्रमण गर्नर् ७० प्रतिशत इथानोल, ०.५ प्रतिशत सोडियम हाइपोक्लोराइटहरू भएको रसायन वा घोलक, प्रयोग गर्नु पर्छ।यी रसायनहरू कहिले पनि मानिसको शरीरमा प्रयोग गर्न हुदैन। यस्ता रसायनहरू छालामा परेमा हानिकारक हुन्छ।"));
    factCheckList.add(FactCheck(title: "४. के पानी पिउनाले घाँटी दुखेको निको हुन्छ, र कोरोना भाइरसको संक्रमणबाट बचाउँछ?", answers: "स्वस्थ रहन पानी पिउनु अति आवश्यक छ। तर यसले कोरोना भाइरसको संक्रमणबाट बचाउँदैन।"));
    factCheckList.add(FactCheck(title: "५. यो कोरोना भाइरसले वृद्धवृद्धालाई मात्र बढी असर गर्छ कि युवावर्ग पनि यसको जोखिम हुन्छन्?", answers: "सबै उमेर समूहका मानिसलाई कोरोना भाइरसले संक्रमण गर्न सक्दछ। तर ज्येष्ठ नागरिक र पहिल्यै देखिनै दम, मधुमेह, मुटुको रोग जस्ता स्वास्थ्य समस्या भएका व्यक्तिहरूलाई भने यो भाइरसले गम्भीर बिरामी बनाउने जोखिम हुन्छ।विश्व स्वास्थ्य संगठनले सिफारिस गरे अनुसार यस भाइरसबाट बच्नको लागि बेलाबेलामा साबुन पानीले मिचिमिचि हात धुने वा अल्कोहल भएको स्यानिटाइजरको प्रयोग गनर्,े श्वासप्रश्वाससम्बन्धी सरसफाईमा विशेष ध्यान दिने जस्तै खोक्दा, हाँच्छ्यु गर्दा नाक मुख छोप्नु पर्दछ।"));
    factCheckList.add(FactCheck(title: "६. के कोरोना भाइरसबाट बच्न र संक्रमितको उपचारको लागि एन्टिबायोटिकको प्रयोग प्रभावकारी हुन्छ?", answers: "एन्टिबायोटिकले ब्याक्टेरिया (जिवाणु) विरुद्ध मात्र लड्न सक्ने क्षमता हुने भएकोले एन्टिबायोटिकको प्रयोगले कोरोना भाइरसको संक्रमणबाट बचाउँदैन वा उपचार गर्न सकिदैन।यदि तपाई कोरोना भाइरसको संक्रमणका कारण अस्पतालमा भर्ना हुनुभएको छ भने शरीरमा ब्याक्टेरियाको संक्रमण पनि हुनसक्ने भएकाले तपाईंलाई चिकित्सकले एन्टिबायोटिक दिएको हुन सक्दछ।"));
    factCheckList.add(FactCheck(title: "७. कोरोना भाइरसबाट बच्ने वा उपचार गर्ने कुनै औषधि छ?", answers: "हालसम्म कोरोना भाइरसबाट बच्न वा उपचारको लागि कुनै औषधि पत्ता लागिसकेको छैन।तर संक्रमितलाई देखिएको लक्षण अनुसारको औषधि उपचार गरी स्याहार गर्नुपर्छ। यस भाइरसबाट संक्रमित गम्भीर बिरामीलाई अस्पतालमा भर्ना गरी लक्षण अनुसारका विशेष उपचार तथा स्याहार गरिन्छ।यसको उपचारको वारेमा धेरै देशहरुमा अध्ययन अनुसन्धान भइरहेको छ भने विश्व स्वास्थ्य संगठनले साझेदारहरुसँगको समन्वयमा यस विषयमा अध्ययन र अनुसन्धानलाई तीव्र रुपले अघि बढाइरहेको छ।"));
    factCheckList.add(FactCheck(title: "८. के हात सुकाउने मेसिन (ह्यान्ड ड्रायर) कोरोना भाइरस मार्नका लागि प्रभावकारी हुन्छ?", answers: "हात सुकाउने मेसिन (ह्यान्ड ड्रायर) कोरोना भाइरस मार्नका लागि कदापि प्रभावकारी हुन सक्दैन। कोरोना भाइरसको संक्रमणबाट बच्नका लागि बेलाबेलामा साबुन पानीले मिचिमिचि हात धुने वा अल्कोहलयुक्त स्यानिटाइजरको प्रयोग गर्नु नै उत्तम उपाय हो। हात धोइसकेपछि भिजेको हात सुकाउनका लागि कागजी रुमाल वा हात सुकाउने ड्रायरको प्रयोग गर्न सकिन्छ। तर सबैजनाले एउटै रुमाल प्रयोग गर्नु हुँदैन।"));
    factCheckList.add(FactCheck(title: "९. के चीनबाट आएको चिठी पत्र वा कुनैपनि सामान लिनु सुरक्षित हुन्छ?", answers: "चीनबाट आएको सामान वा चिठिपत्रबाट कोरोना भाइरस सर्ने जोखिम हुँदैन। किनकि कोरोना भाइरस वस्तुहरू जस्तै चिठी वा बाकसहरुमा लामो समय बाँच्दैनन् भन्ने पुष्टि भइसकेको छ।"));
    factCheckList.add(FactCheck(title: "१०. के युभि किरण (अल्टा भ्वाइलेट प्रकाश)ले कोरोना भाइरस मार्न सक्छ?", answers: "यस्ता युभि किरणले कोरोना भाइरसलाई मार्न सक्दैन। तर यस्ता विकिरणले हात वा शरीरका अन्य अंगहरुमा एलर्जी गराउन सक्छ।"));
    factCheckList.add(FactCheck(title: "११. विमानस्थलमा राखिएको थर्मल स्क्यानरबाट कोरोना भाइरस संक्रमित भए वा नभएको थाहा पाउन कत्तिको प्रभावकारी हुन्छ?", answers: "थर्मल स्क्यानरले कुनैपनि व्यक्तिलाई ज्वरो (शरीरको तापक्रम सामान्यभन्दा बढी) आए वा नआएका थाहा पाउन मद्दत गर्दछ। कोरोना भाइरसको संक्रमणका लक्षण देखिन २ देखि १४ दिन लाग्ने भएकोले यदि कोही व्यक्तिलाई यसको संक्रमण भइसकेको तर ज्वरो नदेखिएको अवस्थामा यो थर्मल स्क्यानरले पत्ता लगाउन सक्दैन।"));
    factCheckList.add(FactCheck(title: "१२. के पुरै शरीरमा अल्कोहल वा क्लोरिन लगाएमा वा छरेमा कोरोना भाइरस मर्छ?", answers: "शरीरभित्र कोरोना भाइरस प्रवेश गरिसकेपछि अल्कोहल वा क्लोरिन पुरै शरीरमा लगाउँदा वा छर्कंदा यो भाइरस मर्दैन। बरु यसरी छर्कनाले तपाईको लुगा वा शरीरमा रहेका स –साना छिद्रहरुका साथै आँखा, मुख, नाक आदिमा हानी पुग्न सक्दछ। याद राख्नुहोस्, सहि मात्रामा प्रयोग गरिएको खण्डमा अल्कोहल र क्लोरिनले भुइँ वा सतहलाई निःसंक्रमण गर्न मद्दत गर्दछ।"));
    factCheckList.add(FactCheck(title: "१३. के घरपालुवा जनावरबाट कोरोना भाइरसको संक्रमण हुन वा सर्न सक्छ?", answers: "हालसम्म घरपालुवा जनावर जस्तै कुकुर, बिरालोआदि कोरोना भाइरसबाट संक्रमित भएको पुष्टि भएको छैन। तर घरमा पालिएका जनावरलाई छोए पश्चात सधैं साबुन पानीले मिचिमिचि हात धुनुपर्छ। यसरी साबुनपानीले हात धोएमा घरपालुवा जनावरबाट मानिसमा सर्न सक्ने ‘इकोली’ र ‘साल्मोनेल्ला’ जस्ता विभिन्न जीवाणुका संक्रमणबाट सुरक्षित हुन्छं।"));
    factCheckList.add(FactCheck(title: "१४. के निमोनिया विरुद्धको खोपले हामीलाई कोरोना भाइरसको संक्रमणबाट बचाउँछ?", answers: "निमोनिया विरुद्धका खोपहरू जस्तै ‘न्युमोकोकल भ्याक्सिन’ र ‘हेमोफिलस इन्फ्लुएन्जा’ टाइप बी भ्याक्सिनले कोरोना भाइरसबाट जोगाउन सक्दैन।यो नयाँ र फरक किसिमको भाइरस भएकोले यसको लागि छुटै प्रकारको खोप चाहिन्छ। कोरोना भाइरस विरुद्धको खोपको विकासका लागि अनुसन्धान भइरहेको छ तर अहिलेसम्म पत्ता लागिसकेको छैन।निमोनिया विरुद्धका खोपहरू कोरोना भाइरस रोकथाम गर्नका लागि उपयोगी नभए तापनि श्वासप्रश्वासको समस्याबाट बच्न यी खोपहरू स्वास्थ्यका लागि लगाउन सिफारिस गरिन्छ।"));
    factCheckList.add(FactCheck(title: "१५. के नियमित सलाईन पानीले नाक सफा गर्नाले कोरोना भाइरसको संक्रमणबाट बच्न सकिन्छ?", answers: "हालसम्म सलाईन पानीले नियमित नाक सफा गर्नाले कोरोना भाइरसको संक्रमणबाट बच्न सकिन प्रमाण फेला परेको छैन।सलाईन पानीले नियमित नाक सफा गर्नाले रुघा चाँडो निको भएको केही तथ्यहरू भने छन्।"));
    factCheckList.add(FactCheck(title: "१६. के माउथवासले मुख कुल्ला गर्नाले कोरोना भाइरसको संक्रमणबाट बच्न सकिन्छ?", answers: "माउथवासको प्रयोगले कोरोना भाइरसको संक्रमणबाट बच्न सकिने कुनैपनि प्रमाण हालसम्म फेला परेको छैन।केही कम्पनीका माउथवासहरुको प्रयोगले मुखभित्र र्‍यालमा रहेका केही भाइरसहरुलाई केही समयका लागि निर्मुल गर्ने भएता पनि यसले कोरोना भाइरसको संक्रमणबाट भने सुरक्षित गर्न सक्दैन।"));
    factCheckList.add(FactCheck(title: "१७. के कोरोना भाइरस गर्मी मौसममा वा आद्रता भएको तापक्रममा बाँच्न सक्छ?", answers: "कोरोना भाइरस गर्मी वा जाडो र आद्रता वा सुख्खा तापक्रम भएका सबै ठाउँहरुमा फैलिसकेको छ। गर्मी वा जाडो जहाँ बस्ने भएपनि सावधानी अपनाउनुपर्छ। यसबाट बच्नका लागि बेलाबेलामा साबुन पानीले मिचिमिचि हात धुनु पर्छ।खोक्दा वा हाँच्छ्यु गर्दा नाक र मुख हात वा टिस्यु वा कुहिनाले छोप्ने गनुपर्छ। प्रयोग गरेको टिस्यु तुरुन्त फोहर र्‍याल्ने ठाँउमा र्‍याल्ने र साबुन पानीले हात धुनु पर्छ।"));
    factCheckList.add(FactCheck(title: "१८. के रक्सी पिउनाले कोरोना भाइरसको संक्रमण हुँदैन?", answers: "रक्सीले कोरोना भाइरसको संक्रमणबाट बचाउँदैन।"));
    factCheckList.add(FactCheck(title: "१९. भुइँ वा सतहहरुलाई निःसक्रमण कसरी गर्न सकिन्छ?", answers: "भुइँ वा सतह फोहर छ भने पहिला साबुन वा सर्फ पानीले भुइँलाई राम्ररी सफा गर्ने। बजारमा पाइने घरेलु निःसंक्रमणमा प्रयोग हुने क्लोरिनयुक्त रसायन वा घोलकले ब्याक्टेरिया र भाइरसलाई मार्दछ। यस्ता रसायन वा घोलकहरु प्रयोग गर्दा सधैं पञ्जा लगाउनुपर्छ। खाली हातले कहिलेपनि प्रयोग गर्नु हुँदैन।"));
    factCheckList.add(FactCheck(title: "२०. धुम्रपान वा चुरोटले कोरोना भाइरसलाई असर गर्छ?", answers: "धुम्रपान वा चुरोटले कोरोना भाइरसको संक्रमणबाट बचाउँदैन। धुम्रपान स्वास्थ्यका लागि हानिकारक हुन्छ। विश्वमा वर्षेनी करिब ८० लाख मानिसहरू धुम्रपानका कारण अकाल मर्दछन्। मुटु लगायत विभिन्न स्वास्थ्य समस्या भएका व्यक्तिहरुमा धुम्रपानका कारणले थप जटिलता हुने भएकोले उनीहरुमा कोरोना भाइरसको जोखिम अझ बढी हुन्छ।"));
    factCheckList.add(FactCheck(title: "२१. पसलमा स्यानिटाइजर नपाएमा के गर्न सकिन्छ?", answers: "स्यानिटाइजर नभएमा पनि केही हुँदैन। बेलाबेलामा साबुन पानीले मिचिमिच हात धोएमा कोरोना भाइरसको जोखिम कम हुन्छ। हात धुँदा औंलाको बीचमा, हातको अगाडि र पछाडि र नङलाई पनि राम्ररी धुनुपर्छ।"));
    factCheckList.add(FactCheck(title: "२२. के दिसाबाट कोरोना भाइरस सर्छ?", answers: "अन्य कोरोना भाइरस जस्तै यो नयाँ कोरोना भाइरस २०१९ दिसामा पनि पाइन्छ। यसबाट संक्रमित व्यक्तिले खोक्दा र हाँच्छयु गर्दा नाक र मुखबाट निस्कने छिटाहरुबाट एक व्यक्तिबाट अर्कोमा सर्दछ।त्यसैले यसको संक्रमणबाट बच्न बेलाबेलामा साबुन पानीले हात धुने वा अल्कोहल भएको स्यानिटाइजर प्रयोग गर्ने, खोक्दा र हाँच्छयु गर्दा नाक र मुख हात वा टिस्यु वा कुहिनाले छोप्ने, प्रयोग गरेको टिस्यु तुरुन्त फोहर र्‍याल्ने ठाँउमा र्‍याल्ने र साबुन पानीले हात धुने, र रुघाखोकी लागेको व्यक्तिबाट टाढा बस्ने।"));
    factCheckList.add(FactCheck(title: "२३. नाली वा ढलबाट आउने हावा, गन्धबाट पनि कोरोना भाइरस हुनसक्छ?", answers: "ढल वा नालीबाट आउने हावा, गन्धमा श्वास फेर्दा कोरोना भाइरस संक्रमण भएको तथ्य हालसम्म पाइएको छैन।हालसम्मको तथ्य अनुसार कोरोना भाइरस संक्रमित व्यक्तिले खोक्दा र हाँच्छय गर्दा नाक र मुखबाट निस्कने छिटाहरु र संक्रमित व्यक्तिसँगको नजिकको सम्पर्कबाट एक व्यक्तिबाट अर्कोमा सर्दछ।"));
    factCheckList.add(FactCheck(title: "२४. के बोझो, लसुन वा बेसार खानाले कोरोना भाइरसको संक्रमणबाट बच्न सकिन्छ?", answers: "लसुन, बोझो र बेसार खानु स्वास्थ्यको लागि लाभदायक हो, यसले हामीलाई स्वस्थ राख्न मद्दत पनि गर्दछ। तर हालसम्म लसुन वा बोझो वा बेसारको प्रयोगले कोरोना भाइरसको संक्रमणबाट सुरक्षित भएको तथ्य फेला परेको छैन।"));


    return factCheckList;
  }
}
class FactCheckPage extends StatelessWidget {

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: covidAppBar(),
      body: Padding(
        padding: const EdgeInsets.only(left:16.0, right: 16.0),
        child: ListView.builder(
          shrinkWrap: true,
          itemCount: FactCheck.factCheckList.length,
            itemBuilder: (context, pos) {
              FactCheck factCheck = FactCheck.factCheckList[pos];
                return ListTile(
                    title: Text("${pos+1}. ${factCheck.title}", style: TextStyle(fontWeight: FontWeight.bold, color: Colors.blue, fontSize: 14.0),),
                  subtitle:  Text(factCheck.answers, style: TextStyle(fontSize: 14.0),));
        }),
      ),
    );
  }
}
